arcade_player_management/app/controllers/players_controller.rb

SELECT "play_histories".* FROM "play_histories" WHERE "play_histories"."player_id" IN (?, ?)  [["player_id", 2], ["player_id", 1]]
SELECT "players".* FROM "players" ORDER BY "players"."updated_at" DESC, "players"."id" DESC
---
  def index
    players = Player.includes(player_characters: :character_master, play_histories: :score_history).recently_updated