arcade_player_management/app/controllers/play_histories_controller.rb

  def set_player
    @player = Player.find(params[:player_id])
---
SELECT "players".* FROM "players" WHERE "players"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]